web/src/test/resources/integrationtests/registertsbas/requests.stg

delimiters "$", "$"

request(intygId, personId) ::= <<
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:riv:itintegration:registry:1" xmlns:urn1="urn:local:se:intygstjanster:services:RegisterTSBasResponder:1" xmlns:urn2="urn:local:se:intygstjanster:services:1" xmlns:urn3="urn:local:se:intygstjanster:services:types:1">
   <soapenv:Header>
      <urn:LogicalAddress>?</urn:LogicalAddress>
   </soapenv:Header>
   <soapenv:Body>
      <urn1:RegisterTSBas>
         <urn1:intyg>
            <urn2:intygsId>$intygId$</urn2:intygsId>
            <urn2:intygsTyp>ts-bas</urn2:intygsTyp>
            <urn2:version>06</urn2:version>
            <urn2:utgava>07</urn2:utgava>
            <urn2:grundData>
               <urn2:signeringsTidstampel>2013-08-12T15:57:00</urn2:signeringsTidstampel>
               <urn2:skapadAv>
                  <urn2:personId>
                     <urn3:root>1.2.752.129.2.1.4.1</urn3:root>
                     <urn3:extension>SE0000000000-1333</urn3:extension>
                  </urn2:personId>
                  <urn2:fullstandigtNamn>Doktor Thompson</urn2:fullstandigtNamn>
                  <urn2:atLakare>false</urn2:atLakare>
                  <urn2:vardenhet>
                     <urn2:enhetsId>
                        <urn3:root>1.2.752.129.2.1.4.1</urn3:root>
                        <urn3:extension>SE0000000000-1337</urn3:extension>
                     </urn2:enhetsId>
                     <urn2:enhetsnamn>Vårdenhet Väst</urn2:enhetsnamn>
                     <urn2:postadress>Enhetsvägen 12</urn2:postadress>
                     <urn2:postnummer>54321</urn2:postnummer>
                     <urn2:postort>Tumba</urn2:postort>
                     <urn2:telefonnummer>08-1337</urn2:telefonnummer>
                     <urn2:vardgivare>
                        <urn2:vardgivarid>
                           <urn3:root>1.2.752.129.2.1.4.1</urn3:root>
                           <urn3:extension>SE0000000000-HAHAHHSAA</urn3:extension>
                        </urn2:vardgivarid>
                        <urn2:vardgivarnamn>Vårdgivarnamn</urn2:vardgivarnamn>
                     </urn2:vardgivare>
                  </urn2:vardenhet>
                  <urn2:specialiteter>SPECIALITET</urn2:specialiteter>
                  <urn2:befattningar>ST_LAKARE</urn2:befattningar>
               </urn2:skapadAv>
               <urn2:patient>
                  <urn2:personId>
                     <urn3:root>1.2.752.129.2.1.3.1</urn3:root>
                     <urn3:extension>$personId$</urn3:extension>
                  </urn2:personId>
                  <urn2:fullstandigtNamn>Herr Dundersjuk</urn2:fullstandigtNamn>
                  <urn2:fornamn>Herr</urn2:fornamn>
                  <urn2:efternamn>Dundersjuk</urn2:efternamn>
                  <urn2:postadress>Testvägen 12</urn2:postadress>
                  <urn2:postnummer>12345</urn2:postnummer>
                  <urn2:postort>Testort</urn2:postort>
               </urn2:patient>
            </urn2:grundData>
            <urn2:intygAvser>
               <urn2:korkortstyp>C1</urn2:korkortstyp>
               <urn2:korkortstyp>C1E</urn2:korkortstyp>
               <urn2:korkortstyp>C</urn2:korkortstyp>
               <urn2:korkortstyp>CE</urn2:korkortstyp>
               <urn2:korkortstyp>D1</urn2:korkortstyp>
               <urn2:korkortstyp>D1E</urn2:korkortstyp>
               <urn2:korkortstyp>D</urn2:korkortstyp>
               <urn2:korkortstyp>DE</urn2:korkortstyp>
               <urn2:korkortstyp>TAXI</urn2:korkortstyp>
               <urn2:korkortstyp>ANNAT</urn2:korkortstyp>
            </urn2:intygAvser>
            <urn2:identitetStyrkt>
               <urn2:idkontroll>IDK6</urn2:idkontroll>
            </urn2:identitetStyrkt>
            <urn2:synfunktion>
               <urn2:harSynfaltsdefekt>true</urn2:harSynfaltsdefekt>
               <urn2:harNattblindhet>true</urn2:harNattblindhet>
               <urn2:harProgressivOgonsjukdom>true</urn2:harProgressivOgonsjukdom>
               <urn2:harDiplopi>true</urn2:harDiplopi>
               <urn2:harNystagmus>true</urn2:harNystagmus>
               <urn2:synskarpaUtanKorrektion>
                  <urn2:hogerOga>0.0</urn2:hogerOga>
                  <urn2:vansterOga>0.0</urn2:vansterOga>
                  <urn2:binokulart>0.0</urn2:binokulart>
               </urn2:synskarpaUtanKorrektion>
               <urn2:synskarpaMedKorrektion>
                  <urn2:hogerOga>0.0</urn2:hogerOga>
                  <urn2:harKontaktlinsHogerOga>true</urn2:harKontaktlinsHogerOga>
                  <urn2:vansterOga>0.0</urn2:vansterOga>
                  <urn2:harKontaktlinsVansterOga>true</urn2:harKontaktlinsVansterOga>
                  <urn2:binokulart>0.0</urn2:binokulart>
               </urn2:synskarpaMedKorrektion>
               <urn2:harGlasStyrkaOver8Dioptrier>true</urn2:harGlasStyrkaOver8Dioptrier>
            </urn2:synfunktion>
            <urn2:horselBalanssinne>
               <urn2:harBalansrubbningYrsel>true</urn2:harBalansrubbningYrsel>
               <urn2:harSvartUppfattaSamtal4Meter>true</urn2:harSvartUppfattaSamtal4Meter>
            </urn2:horselBalanssinne>
            <urn2:rorelseorganensFunktioner>
               <urn2:harRorelsebegransning>true</urn2:harRorelsebegransning>
               <urn2:rorelsebegransningBeskrivning>Spik i foten</urn2:rorelsebegransningBeskrivning>
               <urn2:harOtillrackligRorelseformagaPassagerare>true</urn2:harOtillrackligRorelseformagaPassagerare>
            </urn2:rorelseorganensFunktioner>
            <urn2:hjartKarlSjukdomar>
               <urn2:harRiskForsamradHjarnFunktion>true</urn2:harRiskForsamradHjarnFunktion>
               <urn2:harHjarnskadaICNS>true</urn2:harHjarnskadaICNS>
               <urn2:harRiskfaktorerStroke>true</urn2:harRiskfaktorerStroke>
               <urn2:riskfaktorerStrokeBeskrivning>Förkärlek för Elvismackor</urn2:riskfaktorerStrokeBeskrivning>
            </urn2:hjartKarlSjukdomar>
            <urn2:diabetes>
               <urn2:harDiabetes>true</urn2:harDiabetes>
               <urn2:diabetesTyp>TYP2</urn2:diabetesTyp>
               <urn2:harBehandlingKost>true</urn2:harBehandlingKost>
            </urn2:diabetes>
            <urn2:neurologiskaSjukdomar>true</urn2:neurologiskaSjukdomar>
            <urn2:medvetandestorning>
               <urn2:harMedvetandestorning>true</urn2:harMedvetandestorning>
               <urn2:medvetandestorningBeskrivning>Beskrivning</urn2:medvetandestorningBeskrivning>
            </urn2:medvetandestorning>
            <urn2:harNjurSjukdom>true</urn2:harNjurSjukdom>
            <urn2:harKognitivStorning>true</urn2:harKognitivStorning>
            <urn2:harSomnVakenhetStorning>true</urn2:harSomnVakenhetStorning>
            <urn2:alkoholNarkotikaLakemedel>
               <urn2:harTeckenMissbruk>true</urn2:harTeckenMissbruk>
               <urn2:harVardinsats>true</urn2:harVardinsats>
               <urn2:harVardinsatsProvtagningBehov>true</urn2:harVardinsatsProvtagningBehov>
               <urn2:harLakarordineratLakemedelsbruk>true</urn2:harLakarordineratLakemedelsbruk>
               <urn2:lakarordineratLakemedelOchDos>Läkemedel och dos</urn2:lakarordineratLakemedelOchDos>
            </urn2:alkoholNarkotikaLakemedel>
            <urn2:harPsykiskStorning>true</urn2:harPsykiskStorning>
            <urn2:utvecklingsstorning>
               <urn2:harPsykiskUtvecklingsstorning>true</urn2:harPsykiskUtvecklingsstorning>
               <urn2:harAndrayndrom>true</urn2:harAndrayndrom>
            </urn2:utvecklingsstorning>
            <urn2:sjukhusvard>
               <urn2:harSjukhusvardEllerLakarkontakt>true</urn2:harSjukhusvardEllerLakarkontakt>
               <urn2:sjukhusvardEllerLakarkontaktDatum>20 Januari</urn2:sjukhusvardEllerLakarkontaktDatum>
               <urn2:sjukhusvardEllerLakarkontaktVardinrattning>Vårdcentralen</urn2:sjukhusvardEllerLakarkontaktVardinrattning>
               <urn2:sjukhusvardEllerLakarkontaktAnledning>Akut lungsot</urn2:sjukhusvardEllerLakarkontaktAnledning>
            </urn2:sjukhusvard>
            <urn2:ovrigMedicinering>
               <urn2:harStadigvarandeMedicinering>true</urn2:harStadigvarandeMedicinering>
               <urn2:stadigvarandeMedicineringBeskrivning>Alvedon</urn2:stadigvarandeMedicineringBeskrivning>
            </urn2:ovrigMedicinering>
            <urn2:ovrigKommentar>Här kommer en övrig kommentar</urn2:ovrigKommentar>
            <urn2:bedomning>
               <urn2:korkortstyp>C1</urn2:korkortstyp>
               <urn2:korkortstyp>C1E</urn2:korkortstyp>
               <urn2:korkortstyp>C</urn2:korkortstyp>
               <urn2:korkortstyp>CE</urn2:korkortstyp>
               <urn2:korkortstyp>D1</urn2:korkortstyp>
               <urn2:korkortstyp>D1E</urn2:korkortstyp>
               <urn2:korkortstyp>D</urn2:korkortstyp>
               <urn2:korkortstyp>DE</urn2:korkortstyp>
               <urn2:korkortstyp>TAXI</urn2:korkortstyp>
               <urn2:korkortstyp>ANNAT</urn2:korkortstyp>
               <urn2:kanInteTaStallning>false</urn2:kanInteTaStallning>
               <urn2:behovAvLakareSpecialistKompetens>Spektralanalys</urn2:behovAvLakareSpecialistKompetens>
            </urn2:bedomning>
         </urn1:intyg>
      </urn1:RegisterTSBas>
   </soapenv:Body>
</soapenv:Envelope>
>>
